// Repository: Gaurav-Van/Working-With-COBOL
// File: 1 - Cobol Practice/CONDITIONALS.cob

000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONDITIONALS.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 NUM1 PIC 9(9).
000700 01 NUM2 PIC 9(9).
000800 01 NUM3 PIC 9(5).
000900 01 NUM4 PIC 9(6).
001000 01 NEG-NUM PIC S9(9) VALUE -1234.
001100 01 CLASS1 PIC X(9) VALUE 'ABCD '.
001200 01 CHECK-VAL PIC 9(3).
001300 88 PASS VALUES ARE 041 THRU 100.
001400 88 FAIL VALUES ARE 000 THRU 40.
001500 PROCEDURE DIVISION.
001600        MOVE 25 TO NUM1 NUM3.
001700        MOVE 15 TO NUM2 NUM4.
001800
001900        *> comparing two numbers and checking for equality
002000        IF NUM1 > NUM2 THEN
002100          DISPLAY 'IN LOOP 1 - IF BLOCK'
002200          IF NUM3 = NUM4 THEN
002300            DISPLAY 'IN LOOP 2 - IF BLOCK'
002400          ELSE
002500            DISPLAY 'IN LOOP 2 - ELSE BLOCK'
002600          END-IF
002700        ELSE
002800          DISPLAY 'IN LOOP 1 -ELSE BLOCK'
002900        END-IF
003000
003100        *> use a custom pre-defined condition
003200        *> which checks CHECK-VAL
003300        MOVE 65 TO CHECK-VAL.
003400        IF PASS
003500          DISPLAY 'PASSED WITH 'CHECK-VAL' MARKS.'.
003600        IF FAIL
003700          DISPLAY 'FAILED WITH 'CHECK-VAL' MARKS.'.
003800
003900        *> a switch statment
004000        EVALUATE TRUE
004100          WHEN NUM1 < 2
004200            DISPLAY 'NUM1 LESS THAN 2'
004300          WHEN NUM1 < 19
004400            DISPLAY 'NUM1 LESS THAN 19'
004500          WHEN NUM1 < 1000
004600            DISPLAY 'NUM1 LESS THAN 1000'
004700        END-EVALUATE.
004800      STOP RUN.
004900      